vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Puya.PY32Mxxx_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.0"
  xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="https://raw.githubusercontent.com/Open-CMSIS-Pack/Open-CMSIS-Pack-Spec/v1.7.27/schema/PACK.xsd">
  <vendor>Puya</vendor>
  <url>https://www.puyasemi.com/uploadfiles/</url>
  <name>PY32Mxxx_DFP</name>
  <description>Puya PY32M Series Device Support</description>
  <releases>
    <release version="1.0.6" date="2025-05-22">
        Add PY32MD430 Series.
    </release>
    <release version="1.0.5" date="2025-03-05">
        Add more Series.
    </release>
    <release version="1.0.4" date="2024-10-31">
        Add more Series.
    </release>
    <release version="1.0.3" date="2024-05-30">
        Add PY32M031x8 Series.
    </release>
    <release version="1.0.2" date="2024-03-08">
        Add PY32M07x Series.
    </release>
    <release version="1.0.1" date="2024-01-21">
        Add PY32M020 Series.
    </release>
    <release version="1.0.0" date="2023-05-31">
        First Release version of PY32M Device Family Pack.
    </release>
  </releases>
  <keywords>
    <keyword>Puya</keyword>
    <keyword>Device Support</keyword>
    <keyword>PY32M</keyword>
  </keywords>
  <devices>
    <family Dfamily="PY32M Series" Dvendor="Puya:176">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
      <description>
  The PY32M mainstream microcontrollers are based on high-performance Arm Cortex-M0+ 32-bit RISC core.

  The chip provides sleep and stop low-power operating modes to meet different low-power applications.
  Offering a high level of integration, they are suitable for a variety of application scenarios, such as controllers, handheld devices, PC peripherals, games and GPS platforms, industrial applications, etc.
      </description>

      <sequences>
        <!-- Override for Pre-Defined Sequences -->
        <sequence name="DebugCoreStart">
          <block>
            // Replication of Standard Functionality
            Write32(0xE000EDF0, 0xA05F0001);                                        // Enable Core Debug via DHCSR
          </block>

          <block info="DbgMCU registers">
            // Device Specific Debug Setup
            Write32(0x4002103C, Read32(0x4002103C) | 0x08000000);                   // Set RCC_APBENR1.DBGEN

            Write32(0x40015804, DbgMCU_CR);                                         // DBGMCU_CR: Configure MCU Debug
            Write32(0x40015808, DbgMCU_APB_Fz1);                                    // DBGMCU_APB_FZ1: Configure APB Peripheral Freeze1 Behavior
            Write32(0x4001580C, DbgMCU_APB_Fz2);                                    // DBGMCU_APB_FZ2: Configure APB Peripheral Freeze2 Behavior
          </block>
        </sequence>
      </sequences>

      <!-- ************************  Subfamily 'PY32M010'  **************************** -->
      <subFamily DsubFamily="PY32M010">
        <processor Dclock="48000000"/>
        <debug svd="CMSIS/SVD/PY32M010xx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32M010xx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>

        <memory name="OPT" access="r" start="0x1FFF0080" size="0x00000010" />
        <memory name="OTP" access="r" start="0x1FFF0280" size="0x00000080" />
        <algorithm name="CMSIS/Flash/PY32M010xx_OPT.FLM" start="0x1FFF0080" size="0x00000010" default="0"/>
        <algorithm name="CMSIS/Flash/PY32M010xx_OTP.FLM" start="0x1FFF0280" size="0x00000080" default="0"/>

        <!-- *************************  Device 'PY32M010x5'  ***************************** -->
        <device Dname="PY32M010x5">
          <compile header="Drivers/CMSIS/Device/Include/py32m0xx.h" />
          <memory name="IROM1" access="rx" start="0x08000000" size="0x00006000" startup="1" default="1"/>
          <memory name="IRAM1" access="rw" start="0x20000000" size="0x00000C00" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY32M010xx_24.FLM" start="0x08000000" size="0x00006000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'PY32M020'  **************************** -->
      <subFamily DsubFamily="PY32M020">
        <processor Dclock="48000000"/>
        <debug svd="CMSIS/SVD/PY32M020xx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32M020xx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>

        <memory name="OPT" access="r" start="0x1FFF0E80" size="0x00000010" />
        <algorithm name="CMSIS/Flash/PY32M020xx_OPT.FLM" start="0x1FFF0E80" size="0x00000010" default="0"/>

        <!-- *************************  Device 'PY32M020x6'  ***************************** -->
        <device Dname="PY32M020x6">
          <compile header="Drivers/CMSIS/Device/Include/py32m0xx.h" />
          <memory name="IROM1" access="rx" start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory name="IRAM1" access="rw" start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY32M020xx_32.FLM" start="0x08000000" size="0x00008000" default="1"/>

        </device>
      </subFamily>

      <!-- ************************  Subfamily 'PY32M030'  **************************** -->
      <subFamily DsubFamily="PY32M030">
        <processor Dclock="48000000"/>
        <debug svd="CMSIS/SVD/PY32M030xx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32M030xx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>

