vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Puya.PY32Mxxx_DFP.pdsc
        <memory name="OPT" access="r" start="0x1FFF0E80" size="0x00000010" />
        <algorithm name="CMSIS/Flash/PY32M030xx_OPT.FLM" start="0x1FFF0E80" size="0x00000010" default="0"/>

        <!-- *************************  Device 'PY32M030x8'  ***************************** -->
        <device Dname="PY32M030x8">
          <compile header="Drivers/CMSIS/Device/Include/py32m0xx.h" />
          <memory name="IROM1" access="rx" start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory name="IRAM1" access="rw" start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY32M030xx_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'PY32M031'  **************************** -->
      <subFamily DsubFamily="PY32M031">
        <processor Dclock="48000000"/>
        <debug svd="CMSIS/SVD/PY32M031xx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32M031xx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>

        <memory name="OPT" access="r" start="0x1FFF0E80" size="0x00000010" />
        <memory name="OTP" access="r" start="0x1FFF0D00" size="0x00000080" />
        <algorithm name="CMSIS/Flash/PY32M031xx_OPT.FLM" start="0x1FFF0E80" size="0x00000010" default="0"/>
        <algorithm name="CMSIS/Flash/PY32M031xx_OTP.FLM" start="0x1FFF0D00" size="0x00000080" default="0"/>

        <!-- *************************  Device 'PY32M031x8'  ***************************** -->
        <device Dname="PY32M031x8">
          <compile header="Drivers/CMSIS/Device/Include/py32m0xx.h" />
          <memory name="IROM1" access="rx" start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory name="IRAM1" access="rw" start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY32M031xx_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>
      </subFamily>

            <!-- ************************  Subfamily 'PY32M070'  **************************** -->
      <subFamily DsubFamily="PY32M070">
        <processor Dclock="48000000"/>
        <debug svd="CMSIS/SVD/PY32M070xx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32M070xx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>
        <sequences>
          <!-- Override for Pre-Defined Sequences -->
          <sequence name="DebugCoreStart">
            <block>
            // Replication of Standard Functionality
            Write32(0xE000EDF0, 0xA05F0001);                                        // Enable Core Debug via DHCSR
            </block>

            <block info="DbgMCU registers">
            // Device Specific Debug Setup
            Write32(0x40021040, Read32(0x40021040) | 0x00000400);                   // Set RCC_APBENR1.DBGEN

            Write32(0x40015804, DbgMCU_CR);                                         // DBGMCU_CR: Configure MCU Debug
            Write32(0x40015808, DbgMCU_APB_Fz1);                                    // DBGMCU_APB_FZ1: Configure APB Peripheral Freeze1 Behavior
            Write32(0x4001580C, DbgMCU_APB_Fz2);                                    // DBGMCU_APB_FZ2: Configure APB Peripheral Freeze2 Behavior
            </block>
          </sequence>
        </sequences>

        <memory name="OPT" access="r" start="0x1FFF3100" size="0x00000020" />
        <algorithm name="CMSIS/Flash/PY32M070xx_OPT.FLM" start="0x1FFF3100" size="0x00000020" default="0"/>

        <!-- *************************  Device 'PY32M070xB'  ***************************** -->
        <device Dname="PY32M070xB">
          <compile header="Drivers/CMSIS/Device/Include/py32m0xx.h" />
          <memory name="IROM1" access="rx" start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory name="IRAM1" access="rw" start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY32M070xx_128.FLM" start="0x08000000" size="0x00020000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'PY32M070C'  **************************** -->
      <subFamily DsubFamily="PY32M070C">
        <processor Dclock="48000000"/>
        <debug svd="CMSIS/SVD/PY32M070Cxx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32M070xx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>
        <sequences>
          <!-- Override for Pre-Defined Sequences -->
          <sequence name="DebugCoreStart">
            <block>
            // Replication of Standard Functionality
            Write32(0xE000EDF0, 0xA05F0001);                                        // Enable Core Debug via DHCSR
            </block>

            <block info="DbgMCU registers">
            // Device Specific Debug Setup
            Write32(0x40021040, Read32(0x40021040) | 0x00000400);                   // Set RCC_APBENR1.DBGEN

            Write32(0x40015804, DbgMCU_CR);                                         // DBGMCU_CR: Configure MCU Debug
            Write32(0x40015808, DbgMCU_APB_Fz1);                                    // DBGMCU_APB_FZ1: Configure APB Peripheral Freeze1 Behavior
            Write32(0x4001580C, DbgMCU_APB_Fz2);                                    // DBGMCU_APB_FZ2: Configure APB Peripheral Freeze2 Behavior
            </block>
          </sequence>
        </sequences>

