vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Puya.PY32Mxxx_DFP.pdsc
        <memory name="OPT" access="r" start="0x1FFF3100" size="0x00000020" />
        <algorithm name="CMSIS/Flash/PY32M070xx_OPT.FLM" start="0x1FFF3100" size="0x00000020" default="0"/>

        <!-- *************************  Device 'PY32M070CxB'  ***************************** -->
        <device Dname="PY32M070CxB">
          <compile header="Drivers/CMSIS/Device/Include/py32m0xx.h" />
          <memory name="IROM1" access="rx" start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory name="IRAM1" access="rw" start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY32M070xx_128.FLM" start="0x08000000" size="0x00020000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'PY32MD310'  **************************** -->
      <subFamily DsubFamily="PY32MD310">
        <processor Dclock="48000000"/>
        <debug svd="CMSIS/SVD/PY32MD310xx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32MD310xx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>

        <memory name="OPT" access="r" start="0x1FFF0E80" size="0x00000010" />
        <algorithm name="CMSIS/Flash/PY32MD310xx_OPT.FLM" start="0x1FFF0E80" size="0x00000010" default="0"/>

        <!-- *************************  Device 'PY32MD310x8'  ***************************** -->
        <device Dname="PY32MD310x8">
          <compile header="Drivers/CMSIS/Device/Include/py32m0xx.h" />
          <memory name="IROM1" access="rx" start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory name="IRAM1" access="rw" start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY32MD310xx_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'PY32MD320'  **************************** -->
      <subFamily DsubFamily="PY32MD320">
        <processor Dclock="48000000"/>
        <debug svd="CMSIS/SVD/PY32MD320xx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32MD320xx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>

        <memory name="OPT" access="r" start="0x1FFF0E80" size="0x00000010" />
        <algorithm name="CMSIS/Flash/PY32MD320xx_OPT.FLM" start="0x1FFF0E80" size="0x00000010" default="0"/>

        <!-- *************************  Device 'PY32MD320x8'  ***************************** -->
        <device Dname="PY32MD320x8">
          <compile header="Drivers/CMSIS/Device/Include/py32m0xx.h" />
          <memory name="IROM1" access="rx" start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory name="IRAM1" access="rw" start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY32MD320xx_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'PY32MD410'  **************************** -->
      <subFamily DsubFamily="PY32MD410">
        <processor Dclock="48000000"/>
        <debug svd="CMSIS/SVD/PY32MD410xx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32MD410xx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>

        <memory name="OPT" access="r" start="0x1FFF0E80" size="0x00000010" />
        <memory name="OTP" access="r" start="0x1FFF0D00" size="0x00000080" />
        <algorithm name="CMSIS/Flash/FlashPT067_OB.FLM" start="0x1FFF0E80" size="0x00000010" default="0"/>
        <algorithm name="CMSIS/Flash/FlashPT067_OTP.FLM" start="0x1FFF0D00" size="0x00000080" default="0"/>

        <!-- *************************  Device 'PY32MD410x8'  ***************************** -->
        <device Dname="PY32MD410x8">
          <compile header="Drivers/CMSIS/Device/Include/py32m0xx.h" />
          <memory name="IROM1" access="rx" start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory name="IRAM1" access="rw" start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/FlashPT067_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>
      </subFamily>      

      <!-- ************************  Subfamily 'PY32MD420'  **************************** -->
      <subFamily DsubFamily="PY32MD420">
        <processor Dclock="48000000"/>
        <debug svd="CMSIS/SVD/PY32MD420xx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32MD420xx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>

        <memory name="OPT" access="r" start="0x1FFF0E80" size="0x00000010" />
        <memory name="OTP" access="r" start="0x1FFF0D00" size="0x00000080" />
        <algorithm name="CMSIS/Flash/FlashPT067_OB.FLM" start="0x1FFF0E80" size="0x00000010" default="0"/>
        <algorithm name="CMSIS/Flash/FlashPT067_OTP.FLM" start="0x1FFF0D00" size="0x00000080" default="0"/>

        <!-- *************************  Device 'PY32MD420x8'  ***************************** -->
        <device Dname="PY32MD420x8">
          <compile header="Drivers/CMSIS/Device/Include/py32m0xx.h" />
          <memory name="IROM1" access="rx" start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory name="IRAM1" access="rw" start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/FlashPT067_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'PY32MD430'  **************************** -->
      <subFamily DsubFamily="PY32MD430">
        <processor Dclock="48000000"/>
        <debug svd="CMSIS/SVD/PY32MD430xx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32MD430xx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>

