vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Puya.PY32Mxxx_DFP.pdsc
        <memory name="OPT" access="r" start="0x1FFF0E80" size="0x00000010" />
        <memory name="OTP" access="r" start="0x1FFF0D00" size="0x00000080" />
        <algorithm name="CMSIS/Flash/FlashPT067_OB.FLM" start="0x1FFF0E80" size="0x00000010" default="0"/>
        <algorithm name="CMSIS/Flash/FlashPT067_OTP.FLM" start="0x1FFF0D00" size="0x00000080" default="0"/>

        <!-- *************************  Device 'PY32MD430x8'  ***************************** -->
        <device Dname="PY32MD430x8">
          <compile header="Drivers/CMSIS/Device/Include/py32m0xx.h" />
          <memory name="IROM1" access="rx" start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory name="IRAM1" access="rw" start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/FlashPT067_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="PY32M0">
      <description>Puya PY32M0 Series Devices</description>
      <require Dvendor="Puya:176" Dname="PY32M0*"/>
    </condition>

    <condition id="PY32M0 CMSIS">
      <description>Puya PY32M Series devices and CMSIS</description>
      <require condition="PY32M0"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="PY32M010x5">
      <description>Puya PY32M010x5 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32M010?5*"/>
    </condition>

    <condition id="PY32M020x6">
      <description>Puya PY32M020x6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32M020?6*"/>
    </condition>

    <condition id="PY32M030x8">
      <description>Puya PY32M030x8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32M030?8*"/>
    </condition>

    <condition id="PY32M031x8">
      <description>Puya PY32M031x8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32M031?8*"/>
    </condition>

    <condition id="PY32M070xB">
      <description>Puya PY32M070xB Devices</description>
      <require Dvendor="Puya:176" Dname="PY32M070?B*"/>
    </condition>
    <condition id="PY32M070CxB">
      <description>Puya PY32M070CxB Devices</description>
      <require Dvendor="Puya:176" Dname="PY32M070C?B*"/>
    </condition>

    <condition id="PY32MD310x8">
      <description>Puya PY32MD310x8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32MD310?8*"/>
    </condition>

    <condition id="PY32MD320x8">
      <description>Puya PY32MD320x8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32MD320?8*"/>
    </condition>

    <condition id="PY32MD410x8">
      <description>Puya PY32MD410x8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32MD410?8*"/>
    </condition>

    <condition id="PY32MD420x8">
      <description>Puya PY32MD420x8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32MD420?8*"/>
    </condition>

    <condition id="PY32MD430x8">
      <description>Puya PY32MD430x8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32MD430?8*"/>
    </condition>

    <condition id="PY32M010x5 ARMCC">
      <description>Puya PY32M010x5 Devices and ARMCC Compiler</description>
      <require condition="PY32M010x5"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="PY32M020x6 ARMCC">
      <description>Puya PY32M020x6 Devices and ARMCC Compiler</description>
      <require condition="PY32M020x6"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="PY32M030x8 ARMCC">
      <description>Puya PY32M030x8 Devices and ARMCC Compiler</description>
      <require condition="PY32M030x8"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="PY32M031x8 ARMCC">
      <description>Puya PY32M031x8 Devices and ARMCC Compiler</description>
      <require condition="PY32M031x8"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="PY32M070xB ARMCC">
      <description>Puya PY32M070xB Devices and ARMCC Compiler</description>
      <require condition="PY32M070xB"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="PY32M070CxB ARMCC">
      <description>Puya PY32M070CxB Devices and ARMCC Compiler</description>
      <require condition="PY32M070CxB"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="PY32MD310x8 ARMCC">
      <description>Puya PY32MD310x8 Devices and ARMCC Compiler</description>
      <require condition="PY32MD310x8"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="PY32MD320x8 ARMCC">
      <description>Puya PY32MD320x8 Devices and ARMCC Compiler</description>
      <require condition="PY32MD320x8"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="PY32MD410x8 ARMCC">
      <description>Puya PY32MD410x8 Devices and ARMCC Compiler</description>
      <require condition="PY32MD410x8"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="PY32MD420x8 ARMCC">
      <description>Puya PY32MD420x8 Devices and ARMCC Compiler</description>
      <require condition="PY32MD420x8"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="PY32MD430x8 ARMCC">
      <description>Puya PY32MD430x8 Devices and ARMCC Compiler</description>
      <require condition="PY32MD430x8"/>
      <require condition="Compiler ARMCC"/>
    </condition>

  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.0.1" condition="PY32M0 CMSIS">
      <description>System Startup for Puya PY32M Series</description>
      <files>
        <!--  include folder -->
        <file category="include" name="Drivers/CMSIS/Device/Include/"/>
        <!-- common device header file -->
        <file category="header" name="Drivers/CMSIS/Device/Include/py32m0xx.h"/>
        <file category="header" condition="PY32MD430x8 ARMCC" name="Drivers/CMSIS/Device/Include/py32md4xx.h"/>
        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="source" condition="PY32M010x5 ARMCC" name="Drivers/CMSIS/Device/Source/ARM/startup_py32m010x5.s" attr="config" version="0.0.1"/>
        <file category="source" condition="PY32M020x6 ARMCC" name="Drivers/CMSIS/Device/Source/ARM/startup_py32m020x6.s" attr="config" version="0.0.1"/>
        <file category="source" condition="PY32M030x8 ARMCC" name="Drivers/CMSIS/Device/Source/ARM/startup_py32m030x8.s" attr="config" version="0.0.1"/>
        <file category="source" condition="PY32M031x8 ARMCC" name="Drivers/CMSIS/Device/Source/ARM/startup_py32m031x8.s" attr="config" version="0.0.1"/>
        <file category="source" condition="PY32M070xB ARMCC" name="Drivers/CMSIS/Device/Source/ARM/startup_py32m070xb.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32M070CxB ARMCC" name="Drivers/CMSIS/Device/Source/ARM/startup_py32m070cxb.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32MD310x8 ARMCC" name="Drivers/CMSIS/Device/Source/ARM/startup_py32md310x8.s" attr="config" version="0.0.1"/>
        <file category="source" condition="PY32MD320x8 ARMCC" name="Drivers/CMSIS/Device/Source/ARM/startup_py32md320x8.s" attr="config" version="0.0.1"/>
        <file category="source" condition="PY32MD410x8 ARMCC" name="Drivers/CMSIS/Device/Source/ARM/startup_py32md410x8.s" attr="config" version="0.0.1"/>
        <file category="source" condition="PY32MD420x8 ARMCC" name="Drivers/CMSIS/Device/Source/ARM/startup_py32md420x8.s" attr="config" version="0.0.1"/>
        <file category="source" condition="PY32MD430x8 ARMCC" name="Drivers/CMSIS/Device/Source/ARM/startup_py32md430xx.s" attr="config" version="0.0.1"/>
        
        <!-- system file -->
        <file category="source" condition="PY32M010x5 ARMCC" name="Drivers/CMSIS/Device/Source/system_py32m010.c" attr="config" version="0.0.1"/>
        <file category="source" condition="PY32M020x6 ARMCC" name="Drivers/CMSIS/Device/Source/system_py32m0xx.c" attr="config" version="0.0.1"/>
        <file category="source" condition="PY32M030x8 ARMCC" name="Drivers/CMSIS/Device/Source/system_py32m0xx.c" attr="config" version="0.0.1"/>
        <file category="source" condition="PY32M031x8 ARMCC" name="Drivers/CMSIS/Device/Source/system_py32m0xx.c" attr="config" version="0.0.1"/>
        <file category="source" condition="PY32M070xB ARMCC" name="Drivers/CMSIS/Device/Source/system_py32m0xx.c" attr="config" version="0.0.1"/>
        <file category="source" condition="PY32M070CxB ARMCC" name="Drivers/CMSIS/Device/Source/system_py32m0xx.c" attr="config" version="0.0.1"/>
        <file category="source" condition="PY32MD310x8 ARMCC" name="Drivers/CMSIS/Device/Source/system_py32m0xx.c" attr="config" version="0.0.1"/>
        <file category="source" condition="PY32MD320x8 ARMCC" name="Drivers/CMSIS/Device/Source/system_py32m0xx.c" attr="config" version="0.0.1"/>
        <file category="source" condition="PY32MD410x8 ARMCC" name="Drivers/CMSIS/Device/Source/system_py32m0xx.c" attr="config" version="0.0.1"/>
        <file category="source" condition="PY32MD420x8 ARMCC" name="Drivers/CMSIS/Device/Source/system_py32m0xx.c" attr="config" version="0.0.1"/>
        <file category="source" condition="PY32MD430x8 ARMCC" name="Drivers/CMSIS/Device/Source/system_py32md430.c" attr="config" version="0.0.1"/>
      
      </files>
    </component>
  </components>
</package>
